bearxiong99/SmartCityLighting/Firmware/src/ti/source/ti/devices/cc26x0r2/inc/hw_flash.h
// Field:     [0] RM0
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSPRD_RM0                                             0x00000001
#define FLASH_FSPRD_RM0_BITN                                                 0
#define FLASH_FSPRD_RM0_M                                           0x00000001
#define FLASH_FSPRD_RM0_S                                                    0

//*****************************************************************************
//
// Register: FLASH_O_FEDACCTL1
//
//*****************************************************************************
// Field:    [24] SUSP_IGNR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEDACCTL1_SUSP_IGNR                                   0x01000000
#define FLASH_FEDACCTL1_SUSP_IGNR_BITN                                      24
#define FLASH_FEDACCTL1_SUSP_IGNR_M                                 0x01000000
#define FLASH_FEDACCTL1_SUSP_IGNR_S                                         24

//*****************************************************************************
//
// Register: FLASH_O_FEDACSTAT
//
//*****************************************************************************
// Field:    [25] RVF_INT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEDACSTAT_RVF_INT                                     0x02000000
#define FLASH_FEDACSTAT_RVF_INT_BITN                                        25
#define FLASH_FEDACSTAT_RVF_INT_M                                   0x02000000
#define FLASH_FEDACSTAT_RVF_INT_S                                           25

// Field:    [24] FSM_DONE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEDACSTAT_FSM_DONE                                    0x01000000
#define FLASH_FEDACSTAT_FSM_DONE_BITN                                       24
#define FLASH_FEDACSTAT_FSM_DONE_M                                  0x01000000
#define FLASH_FEDACSTAT_FSM_DONE_S                                          24

//*****************************************************************************
//
// Register: FLASH_O_FBPROT
//
//*****************************************************************************
// Field:     [0] PROTL1DIS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBPROT_PROTL1DIS                                      0x00000001
#define FLASH_FBPROT_PROTL1DIS_BITN                                          0
#define FLASH_FBPROT_PROTL1DIS_M                                    0x00000001
#define FLASH_FBPROT_PROTL1DIS_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FBSE
//
//*****************************************************************************
// Field:  [15:0] BSE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSE_BSE_W                                                    16
#define FLASH_FBSE_BSE_M                                            0x0000FFFF
#define FLASH_FBSE_BSE_S                                                     0

//*****************************************************************************
//
// Register: FLASH_O_FBBUSY
//
//*****************************************************************************
// Field:   [7:0] BUSY
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBBUSY_BUSY_W                                                  8
#define FLASH_FBBUSY_BUSY_M                                         0x000000FF
#define FLASH_FBBUSY_BUSY_S                                                  0

//*****************************************************************************
//
// Register: FLASH_O_FBAC
//
//*****************************************************************************
// Field:    [16] OTPPROTDIS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBAC_OTPPROTDIS                                       0x00010000
#define FLASH_FBAC_OTPPROTDIS_BITN                                          16
#define FLASH_FBAC_OTPPROTDIS_M                                     0x00010000
#define FLASH_FBAC_OTPPROTDIS_S                                             16

// Field:  [15:8] BAGP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBAC_BAGP_W                                                    8
#define FLASH_FBAC_BAGP_M                                           0x0000FF00
#define FLASH_FBAC_BAGP_S                                                    8

// Field:   [7:0] VREADS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBAC_VREADS_W                                                  8
#define FLASH_FBAC_VREADS_M                                         0x000000FF
#define FLASH_FBAC_VREADS_S                                                  0

//*****************************************************************************
//
// Register: FLASH_O_FBFALLBACK
//
//*****************************************************************************
// Field: [27:24] FSM_PWRSAV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_FSM_PWRSAV_W                                        4
#define FLASH_FBFALLBACK_FSM_PWRSAV_M                               0x0F000000
#define FLASH_FBFALLBACK_FSM_PWRSAV_S                                       24

// Field: [19:16] REG_PWRSAV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_REG_PWRSAV_W                                        4
#define FLASH_FBFALLBACK_REG_PWRSAV_M                               0x000F0000
#define FLASH_FBFALLBACK_REG_PWRSAV_S                                       16

// Field: [15:14] BANKPWR7
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR7_W                                          2
#define FLASH_FBFALLBACK_BANKPWR7_M                                 0x0000C000
#define FLASH_FBFALLBACK_BANKPWR7_S                                         14

// Field: [13:12] BANKPWR6
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR6_W                                          2
#define FLASH_FBFALLBACK_BANKPWR6_M                                 0x00003000
#define FLASH_FBFALLBACK_BANKPWR6_S                                         12

// Field: [11:10] BANKPWR5
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR5_W                                          2
#define FLASH_FBFALLBACK_BANKPWR5_M                                 0x00000C00
#define FLASH_FBFALLBACK_BANKPWR5_S                                         10

// Field:   [9:8] BANKPWR4
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR4_W                                          2
#define FLASH_FBFALLBACK_BANKPWR4_M                                 0x00000300
#define FLASH_FBFALLBACK_BANKPWR4_S                                          8

